/* 个人信息已删除 */
#pragma once

/* 将所有const常量定义的头文件包含进来 */
#include "hanoi_const_value.h"

/* 菜单函数 */
int hanoi_menu();

void hanoi1();// 菜单1：基本解
void hanoi2();// 菜单2：基本解(步数记录)
void hanoi3();// 菜单3：内部数组显示(横向)
void hanoi4();// 菜单4：内部数组显示(纵向+横向)
void hanoi5();// 菜单5：图形解-预备-画三个圆柱
void hanoi6();// 菜单6：图形解-预备-在起始柱上画n个盘子
void hanoi7();// 菜单7：图形解-预备-第一次移动
void hanoi8();// 菜单8：图形解-自动移动版本
void hanoi9();// 菜单9：图形解-游戏版

/* ------------------------------------------------------------------------------------------------------

     本文件功能：
	1、为了保证 hanoi_main.cpp/hanoi_menu.cpp/hanoi_multiple_solutions.cpp 能相互访问函数的函数声明
	2、一个以上的cpp中用到的宏定义（#define）或全局只读（const）变量，个数不限
	3、可以参考 cmd_console_tools.h 的写法（认真阅读并体会）
   ------------------------------------------------------------------------------------------------------ */


